benchmark/results/wrk-gogo-single.log
== gogo [single] /hello  t=1 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3002/hello
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.94ms  259.99us  11.32ms   97.31%
    Req/Sec   279.93k    12.12k  296.63k    88.24%
  Latency Distribution
     50%    0.90ms
     75%    0.93ms
     90%    0.99ms
     99%    1.53ms
  1420330 requests in 5.11s, 197.76MB read
Requests/sec: 278210.23
Transfer/sec:     38.74MB
== gogo [single] /hello  t=4 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3002/hello
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.09ms    3.45ms  60.97ms   97.77%
    Req/Sec    71.54k    14.22k  145.85k    85.50%
  Latency Distribution
     50%    1.57ms
     75%    1.65ms
     90%    2.14ms
     99%   17.84ms
  1425339 requests in 5.04s, 198.46MB read
Requests/sec: 282910.55
Transfer/sec:     39.39MB
== gogo [single] /hello/inon  t=1 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3002/hello/inon
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.93ms  157.85us   5.86ms   96.86%
    Req/Sec   282.44k    10.23k  296.23k    90.00%
  Latency Distribution
     50%    0.90ms
     75%    0.93ms
     90%    0.98ms
     99%    1.45ms
  1404809 requests in 5.01s, 194.26MB read
Requests/sec: 280618.55
Transfer/sec:     38.80MB
== gogo [single] /hello/inon  t=4 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3002/hello/inon
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.69ms  392.88us  12.18ms   93.97%
    Req/Sec    73.41k     6.41k   79.27k    85.00%
  Latency Distribution
     50%    1.62ms
     75%    1.68ms
     90%    1.81ms
     99%    3.43ms
  1460773 requests in 5.00s, 202.00MB read
Requests/sec: 291972.35
Transfer/sec:     40.37MB
== gogo [single] /db  t=1 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3002/db
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.69ms    1.79ms  25.88ms   90.92%
    Req/Sec   181.28k    37.02k  228.69k    68.00%
  Latency Distribution
     50%    2.23ms
     75%    2.61ms
     90%    4.18ms
     99%   10.71ms
  903068 requests in 5.02s, 170.25MB read
Requests/sec: 180066.70
Transfer/sec:     33.95MB
== gogo [single] /db  t=4 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3002/db
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.72ms    3.92ms  75.00ms   89.75%
    Req/Sec    38.54k    12.72k   84.02k    72.50%
  Latency Distribution
     50%    2.49ms
     75%    3.69ms
     90%    7.75ms
     99%   19.85ms
  769702 requests in 5.07s, 145.11MB read
Requests/sec: 151770.54
Transfer/sec:     28.61MB